LEXICON: dict = {
    '/start': 'Привет!',
    '/add_notification': '📆 Чтобы добавить напоминание',
    '/list_notifications': '📒 Список напоминаний',
    '/back': '❌ Назад',
    'unknown': '❌ Не известная команда',
    'back': '❌ Назад',
    'menu': 'Меню',
    'notification_added': '✅ Напоминание установленно',
    'custom_notification': 'Выберете час ⌚, когда будет срабатывать напоминание',
    'pick_minutes': 'Выберете минуту ⌚, когда будет срабатывать напоминание',
    'choice_days': 'Выберите дни недели, в которые должно срабатывать уведомление',
    'choice_month': 'Выберите месяц',
    'choice_year': 'Выберите год',
    'choice_day': 'Выберите день',
    'choice_hour': 'Выберете час ⌚',
    'choice_minute': 'Выберете минуту ⌚',
    'text': 'Добавьте текст для напоминания',
    'write_text': '❌ Неверный формат \n'
                  'Пожалуйста, добавьте текст'
}

LEXICON_BUTTONS: dict = {
    'add_notification': '📆 Добавить напоминание',
    'list_notifications': '📒 Список напоминаний',
    'menu': 'Меню',
    'backward': '<',
    'forward': '>',
    'week_days': 'Дни недели',
    'exact_date': 'Точна дата',
    'confirm': '✅ Подтвердить'
}

LEXICON_MENU_COMMANDS = {
    '/start': 'Начать',
    '/add_notification': '📆 Как добавить напоминание',
    '/list_notifications': '📒 Список напоминаний',
}

day_name_ru = {
    'Monday': 'Пн',
    'Tuesday': 'Вт',
    'Wednesday': 'Ср',
    'Thursday': 'Чт',
    'Friday': 'Пт',
    'Saturday': 'Сб',
    'Sunday': 'Вс'
}
month_name_ru = {
    'January': 'Янв',
    'February': 'Фев',
    'March': 'Мар',
    'April': 'Апр',
    'May': 'Май',
    'June': 'Июн',
    'July': 'Июл',
    'August': 'Авг',
    'September': 'Сен',
    'October': 'Окт',
    'November': 'Ноя',
    'December': 'Дек'
}